var allAns = [
	{
		"head": "习题1（单选题 ）",
		"title": "毛泽东思想的主要理论渊源是（ ）",
		"ans": [
			"☑ 马列主义"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "马克思主义中国化的实质就是（ ）。",
		"ans": [
			"☑ 将马克思主义基本原理同中国具体实际相结合"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "马克思主义中国化有（ ）大理论成果。",
		"ans": [
			"☑ 二"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "毛泽东思想形成的实践基础是（ ）",
		"ans": [
			"☑ 中国共产党领导的革命和建设的实践"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "毛泽东思想写进党章是在（ ）",
		"ans": [
			"☑ 党的七大"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "毛泽东思想形成和发展的历史条件，与我们今天面临的形势和任务有很大的不同，所以我们不必坚持毛泽东思想。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "毛泽东思想是以毛泽东名字命名的，包括毛泽东个人的所有思想。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "（ ）毛泽东进一步提出了人民民主专政理论、社会主义革命和社会主义建设的理论。",
		"ans": [
			"☑ 解放战争和新中国成立之后"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "毛泽东思想的活的灵魂是（ ）。",
		"ans": [
			"☑ 实事求是、群众路线、独立自主"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "最先提出“马克思主义中国化”命题的人是（ ）。",
		"ans": [
			"☑ 毛泽东"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "马克思主义中国化第一次飞跃的理论成果是（ ）。",
		"ans": [
			"☑ 毛泽东思想"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "毛泽东对“实事求是”的含义作出的界定是（ ）",
		"ans": [
			"☑ “实事”就是客观存在的事物",
			"☑ “是”就是客观事物的内部联系，即规律性",
			"☑ “求”就是我们去研究"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "群众路线就是( )",
		"ans": [
			"☑ 从群众中来",
			"☑ 一切为了群众",
			"☑ 一切依靠群众",
			"☑ 到群众中去"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "关于独立自主下列哪些说法是正确的（ ）",
		"ans": [
			"☑ 坚持独立自主，就要坚持独立自主的和平外交政策",
			"☑ 坚持独立自主，就要坚持中国的事情必须中国人民自己处理",
			"☑ 独立自主就是坚持独立思考，走自己的路"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "毛泽东提出并阐述了农村包围城市、武装夺取政权的思想，标志着毛泽东思想的初步形成。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题9（判断题 ）",
		"title": "毛泽东思想是一个博大精深的科学思想体系，其主题是中国革命与建设。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题10（判断题 ）",
		"title": "思想政治工作是经济工作和其他一切工作的生命线。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题11（判断题 ）",
		"title": "坚持实事求是，就必须坚持一切从实际出发。",
		"ans": [
			"☑ 正确",
			"☑ 它没有完全坚持马列主义",
			"☑ 它是毛泽东个人的思想",
			"☑ 它包括毛泽东晚年所犯错误"
		]
	},
	{
		"head": "习题1（多选题 ）",
		"title": "以下对毛泽东思想的理解错误的有（ ）",
		"ans": [
			"☑ 它没有完全坚持马列主义",
			"☑ 它包括毛泽东晚年所犯错误",
			"☑ 它是毛泽东个人的思想"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "以下对毛泽东思想和中国特色社会主义理论体系的关系的理解错误的有( )",
		"ans": [
			"☑ 二者毫无关联",
			"☑ 二者完全一样"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "以下对毛泽东思想的历史地位正确的理解有 ( )",
		"ans": [
			"☑ 它是中国革命和建设的科学指南",
			"☑ 它是党和人民的宝贵精神财富",
			"☑ 它是马克思主义中国化第一次历史性飞跃的理论成果"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "毛泽东思想基本原理、原则和科学方法具有普遍意义。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "毛泽东的功绩是第一位的，错误是第二位的。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "毛泽东指出，解决中国一切革命问题的最根本的根据是（ ）",
		"ans": [
			"☑ 认清中国社会的特殊国情"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "近代中国社会最主要的一组矛盾是（ ）。",
		"ans": [
			"☑ 帝国主义和中华民族的矛盾"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "中国旧民主主义革命变成新民主主义革命的标志是（ ）",
		"ans": [
			"☑ 五四运动"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "近代中国社会的性质是封建社会而不是资本主义社会。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "标志着中国旧民主主义革命向新民主主义革命转变的重大事件是新文化运动。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "中国民主主义革命经历了旧民主主义革命和新民主主义革命两个阶段，“旧”阶段转化到“新”阶段的根本标志是中国社会主要矛盾的变化。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "帝国主义的侵略是近代中国贫困落后和一切灾祸的总根源。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "毛泽东完整地表述新民主主义革命总路线的内容是在（ ）",
		"ans": [
			"☑ 1948年在晋绥干部会议上的讲话"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "中国革命的动力不包括以下的（ ）。",
		"ans": [
			"☑ 官僚资产阶级"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "中国近代民主革命的主力军是（ ）",
		"ans": [
			"☑ 农民阶级"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "中国无产阶级在新民主主义革命中最可靠的同盟军是（ ）",
		"ans": [
			"☑ 贫雇农"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "新民主主义革命的指导思想是（ ）",
		"ans": [
			"☑ 马克思列宁主义"
		]
	},
	{
		"head": "习题6（单选题 ）",
		"title": "“因为中国资产阶级根本上与剥削农民的豪绅地主相联结相混合，中国革命要推翻豪绅地主阶级，便不能不同时推翻资产阶级”这一观点的主要错误是（ ）",
		"ans": [
			"☑ 混淆了民主革命和社会主义革命的任务"
		]
	},
	{
		"head": "习题7（单选题 ）",
		"title": "新民主主义社会的“国体”是（ ）",
		"ans": [
			"☑ 几个革命阶级的联合专政"
		]
	},
	{
		"head": "习题8（单选题 ）",
		"title": "新民主主义国家的“政体”是（ ）",
		"ans": [
			"☑ 民主集中制的人民代表大会制"
		]
	},
	{
		"head": "习题9（单选题 ）",
		"title": "1941年毛泽东在《新民主主义论》中提出的文化纲领是（ ）",
		"ans": [
			"☑ 民族的、科学的、大众的文化"
		]
	},
	{
		"head": "习题10（多选题 ）",
		"title": "新民主主义革命总路线主要内容是（ ）",
		"ans": [
			"☑ 无产阶级领导的",
			"☑ 人民大众的",
			"☑ 反对帝国主义、封建主义和官僚资本主义"
		]
	},
	{
		"head": "习题11（多选题 ）",
		"title": "新民主主义革命的敌人有（ ）。",
		"ans": [
			"☑ 官僚资本主义",
			"☑ 封建主义",
			"☑ 帝国主义"
		]
	},
	{
		"head": "习题12（多选题 ）",
		"title": "帝国主义之所以成为中国民族民主革命最主要的对象，是因为（ ）",
		"ans": [
			"☑ 它支持或扶植中国的封建主义统治",
			"☑ 它操纵着近代中国社会政治、经济命脉",
			"☑ 它是近代中国社会一切灾难的总根源"
		]
	},
	{
		"head": "习题13（多选题 ）",
		"title": "1948年毛泽东明确将官僚资本主义列为新民主主义革命的又一对象，是因为（ ）",
		"ans": [
			"☑ 它具有买办性、封建性、垄断性",
			"☑ 它严重阻碍着中国社会经济的发展"
		]
	},
	{
		"head": "习题14（多选题 ）",
		"title": "中国无产阶级成为新民主主义革命领导阶级的自身条件是（ ）",
		"ans": [
			"☑ 大多来自于破产的农民，易于结成工农联盟",
			"☑ 与先进的生产方式相联系，富于组织性、纪律性",
			"☑ 深受帝国主义、封建主义和资本主义的三重压迫，革命最坚决",
			"☑ 分布集中，易于组织"
		]
	},
	{
		"head": "习题15（多选题 ）",
		"title": "半殖民地半封建中国的资产阶级分为大资产阶级和小资产阶级两部分。对这种说法理解正确的是（ ）",
		"ans": [
			"☑ 这种说法是错误的，小资产阶级基本上是劳动者，不是资产阶级的组成部分",
			"☑ 这种说法是错误的，中国的资产阶级分为官僚资产阶级和民族资产阶级两部分"
		]
	},
	{
		"head": "习题16（多选题 ）",
		"title": "毛泽东在领导新民主主义革命过程中对民族资产阶级进行了正确的分析，其基本观点主要有（ ）",
		"ans": [
			"☑ 民族资产阶级同帝国主义、封建主义有着千丝万缕的联系",
			"☑ 民族资产阶级的政治主张是实现资产阶级专政的共和国",
			"☑ 民族资产阶级代表的是资本主义的生产关系",
			"☑ 民族资产阶级是一个既有革命性又有妥协性的阶级"
		]
	},
	{
		"head": "习题17（多选题 ）",
		"title": "新民主主义的经济纲领包括（ ）",
		"ans": [
			"☑ 没收官僚垄断资本归新民主主义国家所有",
			"☑ 没收封建地主阶级的土地归农民所有",
			"☑ 保护民族工商业"
		]
	},
	{
		"head": "习题18（多选题 ）",
		"title": "毛泽东认为中国是一个“两头小、中间大”的社会，所谓“两头”是指（ ）",
		"ans": [
			"☑ 地主阶级",
			"☑ 官僚买办阶级",
			"☑ 工人阶级"
		]
	},
	{
		"head": "习题19（判断题 ）",
		"title": "城市小资产阶级是资产阶级。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题20（判断题 ）",
		"title": "中国的民族资产阶级是一个带有两面性的阶级。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题21（判断题 ）",
		"title": "新民主主义革命反对官僚资本主义，既然反对资本主义，就是无产阶级社会主义革命。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题22（判断题 ）",
		"title": "新民主主义革命是无产阶级领导的，所以是社会主义革命。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题23（判断题 ）",
		"title": "区别旧民主主义革命与新民主主义革命的根本标志，是革命的指导思想不同。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题24（判断题 ）",
		"title": "无产阶级的领导权是新民主主义革命理论的核心问题。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题25（判断题 ）",
		"title": "无产阶级及其政党的领导是中国革命取得胜利的根本保证。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题26（判断题 ）",
		"title": "新民主主义革命和社会主义革命的关系是，前者是必要准备，后者是必然趋势。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题27（判断题 ）",
		"title": "新民主主义革命的政治目标是建立新民主主义的共和国。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "新民主主义革命的道路是（ ）",
		"ans": [
			"☑ 农村包围城市，武装夺取政权"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "新民主主义革命的三大法宝（ ）",
		"ans": [
			"☑ 党的建设",
			"☑ 统一战线",
			"☑ 武装斗争"
		]
	},
	{
		"head": "习题3（判断题 ）",
		"title": "武装斗争是中国新民主主义革命的唯一形式。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "以下哪种经济不属于新民主主义社会的主要经济成分（ ）。",
		"ans": [
			"☑ 混合所有制经济"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "新民主主义社会的主要矛盾是（ ）",
		"ans": [
			"☑ 工人阶级同资产阶级的矛盾"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "1953年，毛泽东和中共中央提出了加快从新民主主义社会向社会主义社会转变的（ ）",
		"ans": [
			"☑ 过渡时期的总路线"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "关于新民主主义社会性质的说法正确的有（ ）",
		"ans": [
			"☑ 是属于社会主义体系的过渡性社会",
			"☑ 是一个既有社会主义因素又有非社会主义因素的过渡性社会",
			"☑ 是一个社会主义因素起决定作用，必然向社会主义过渡的社会"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "新民主主义社会中阶级的构成主要有（ ）",
		"ans": [
			"☑ 农民阶级",
			"☑ 工人阶级",
			"☑ 民族资产阶级",
			"☑ 小资产阶级"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "新中国一成立，党就面临大规模社会主义改造和有计划经济建设的任务。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "1949年中华人民共和国成立，标志着新民主主义革命胜利结束，社会主义新中国从此在世界东方屹立起来。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "通过没收官僚资本，新中国建立了社会主义性质的（ ）",
		"ans": [
			"☑ 国营经济"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "过渡时期“一化三改造”的总路线中，“一化”指的是（ ）",
		"ans": [
			"☑ 工业化"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "党对农业的社会主义改造采取了循序渐进的步骤，逐步实现过渡。其中第二步是组织（ ）",
		"ans": [
			"☑ 初级农业生产合作社"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "我国在对农业和手工业进行社会主义改造时采取的方针是（ ）",
		"ans": [
			"☑ 积极领导、稳步前进"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "社会主义改造时期，党对资本主义工商业改造的重要方法是（ ）",
		"ans": [
			"☑ 和平赎买"
		]
	},
	{
		"head": "习题6（单选题 ）",
		"title": "中国在对资本主义工商业进行社会主义改造的过程中，在利润分配上采取的政策是（ ）",
		"ans": [
			"☑ 四马分肥"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "我国在农业社会主义改造中，遵循的原则是（ ）",
		"ans": [
			"☑ 典型示范",
			"☑ 国家帮助",
			"☑ 自愿互利"
		]
	},
	{
		"head": "习题8（多选题 ）",
		"title": "我国在农业社会主义改造中，大致经历了三个阶段（ ）",
		"ans": [
			"☑ 高级社",
			"☑ 初级社",
			"☑ 互助组"
		]
	},
	{
		"head": "习题9（多选题 ）",
		"title": "我国手工业的社会主义改造，建立了手工业生产合作社后，入社人员（ ）",
		"ans": [
			"☑ 参加集体劳动",
			"☑ 按劳分配"
		]
	},
	{
		"head": "习题10（多选题 ）",
		"title": "社会主义改造的成功经验有 ( )",
		"ans": [
			"☑ 积极引导，逐步过渡",
			"☑ 采用和平方法",
			"☑ 社会主义工业化建设与社会主义改造同时并举"
		]
	},
	{
		"head": "习题11（判断题 ）",
		"title": "在社会主义农业改造中，农民即是私有者，又是劳动者，因此要采取强制改造的原则。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题12（判断题 ）",
		"title": "无论是资本主义工商业，还是农民和手工业者的个体所有制，都具有私有制的特点。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题13（判断题 ）",
		"title": "我国社会主义的改造中出现的国家资本主义经济，主要是为资本家的利润而存在。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题14（判断题 ）",
		"title": "资本主义工商业者的改造是使其成为自食其力的社会主义劳动者。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "1956年底，三大改造的基本完成，标志着社会主义制度在我国（ ）",
		"ans": [
			"☑ 初步确立"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "我国生产资料的社会主义改造基本完成于(　 )",
		"ans": [
			"☑ 1956年底"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "以下关于社会主义制度建立重要意义的表述正确的有（ ）",
		"ans": [
			"☑ 社会主义制度的确立使广大劳动人民真正成为国家的主人和社会生产资料的主人",
			"☑ 中国社会主义制度的确立，使占世界人口1/4的东方大国进入了社会主义社会，这是世界社会主义运动史上又一个历史性的伟大胜利。",
			"☑ 社会主义制度的确立为当代中国的一切进步奠定了制度基础。",
			"☑ 中国社会主义制度的确立，是马克思列宁主义关于社会主义革命理论在中国正确运用和创造性发展的结果。"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "社会主义制度的确立是中国历史上最深刻最伟大的社会变革，也是20世纪中国又一次划时代的历史巨变。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "建国以后，毛泽东明确提出“以苏为鉴，独立自主地探索适合中国情况的社会主义建设道路”的著作是（ ）",
		"ans": [
			"☑ 《论十大关系》"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "毛泽东《论十大关系》中论述的第一大关系是（ ）",
		"ans": [
			"☑ 重工业、轻工业和农业的关系"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "毛泽东《论十大关系》讨论的问题没有以下（ ）",
		"ans": [
			"☑ 教育科技问题"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "社会主义社会存在敌我矛盾和人民内部矛盾两种不同性质的矛盾，以下哪组矛盾属于敌我矛盾（ ）",
		"ans": [
			"☑ 社会主义劳动者同反革命者的矛盾"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "根据毛泽东对社会主义社会矛盾的理解，用民主的方法来解决人民内部矛盾，下列哪些不属于民主方法（ ）",
		"ans": [
			"☑ 剥夺政治权利的方法"
		]
	},
	{
		"head": "习题6（单选题 ）",
		"title": "根据毛泽东对社会主义社会矛盾的理解，用专政的方法来解决敌我矛盾，下列哪些不属于专政的方法（ ）",
		"ans": [
			"☑ 说服教育的方法"
		]
	},
	{
		"head": "习题7（单选题 ）",
		"title": "毛泽东在《关于正确处理人民内部矛盾的问题》的报告中指出，关于正确处理人民内部矛盾的方针，毛泽东所指的总方针是（ ）",
		"ans": [
			"☑ 用民主的方法解决人民内部"
		]
	},
	{
		"head": "习题8（单选题 ）",
		"title": "毛泽东明确提出要走一条有别于苏联的中国工业化道路的著作是（ ）",
		"ans": [
			"☑ 《关于正确处理人民内部矛盾的问题》"
		]
	},
	{
		"head": "习题9（单选题 ）",
		"title": "针对社会主义建设初期生产力落后、经济基础薄弱的实际，经济建设的重点必须是发展（ ）",
		"ans": [
			"☑ 重工业"
		]
	},
	{
		"head": "习题10（单选题 ）",
		"title": "毛泽东指出，社会主义现代化的战略目标，是要把中国建设成为一个具有现代农业、现代工业、现代国防和现代（ ）的强国。",
		"ans": [
			"☑ 科学技术"
		]
	},
	{
		"head": "习题11（单选题 ）",
		"title": "中国共产党提出“向科学进军”口号是在（ ）",
		"ans": [
			"☑ 社会主义建设时期"
		]
	},
	{
		"head": "习题12（多选题 ）",
		"title": "毛泽东在《论十大关系》中提出应当处理好的政治关系有（ ）",
		"ans": [
			"☑ 革命和反革命关系",
			"☑ 党和非党关系",
			"☑ 汉族和少数民族关系",
			"☑ 中国和外国关系"
		]
	},
	{
		"head": "习题13（多选题 ）",
		"title": "毛泽东在《论十大关系》中提出应当处理好的经济关系有（ ）",
		"ans": [
			"☑ 重工业和轻工业、农业的关系",
			"☑ 经济建设和国防建设的关系",
			"☑ 沿海工业和内地工业的关系",
			"☑ 国家、生产单位和生产者个人的关系"
		]
	},
	{
		"head": "习题14（多选题 ）",
		"title": "社会主义社会的基本矛盾包括（ ）",
		"ans": [
			"☑ 上层建筑与经济基础的矛盾",
			"☑ 生产关系与生产力的矛盾"
		]
	},
	{
		"head": "习题15（多选题 ）",
		"title": "关于社会主义建设道路初步探索时期取得的成就，下列说法正确的有（ ）",
		"ans": [
			"☑ 从根本上解决了工业化“从无到有”的问题",
			"☑ 我们现在赖以进行现代化建设的物质技术基础，很大一部分是这个时期建设起来的",
			"☑ 全国经济文化建设的骨干力量，大部分是在这个时期培养和积累起来的",
			"☑ 基本建立了独立的比较完整的工业体系和国民经济体系"
		]
	},
	{
		"head": "习题16（判断题 ）",
		"title": "《论十大关系》标志着党探索中国社会主义建设道路的良好开端。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题17（判断题 ）",
		"title": "社会主义改造完成后，国内矛盾发生了重大变化，无产阶级同民族资产阶级之间的矛盾已经上升为社会主要矛盾。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题18（判断题 ）",
		"title": "人民内部矛盾是在人民利益根本一致的基础上的矛盾，因而是非对抗性矛盾。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题19（判断题 ）",
		"title": "敌我之间的矛盾是根本利益对立基础上的矛盾，因而是对抗性矛盾。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题20（判断题 ）",
		"title": "敌我之间和人民内部这两类矛盾的性质不同，解决的方法也不同。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题21（判断题 ）",
		"title": "在社会主义社会建成以前，无产阶级与资产阶级的矛盾，社会主义道路与资本主义道路的矛盾，始终是我国社会的主要矛盾。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题22（判断题 ）",
		"title": "实现工业化是近代以来历史发展的必然要求，也是国家独立和富强的必要条件。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题23（判断题 ）",
		"title": "社会主义代替资本主义，就是要全盘否定和抛弃资本主义创造的一切成果。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（多选题 ）",
		"title": "社会主义建设道路初步探索的重要意义有（ ）",
		"ans": [
			"☑ 避免了社会主义再走弯路"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "党对社会主义建设道路初步探索的经验教训告诉我们，社会主义建设不能（ ）",
		"ans": [
			"☑ 大规模的政治运动",
			"☑ 急于求成"
		]
	},
	{
		"head": "习题3（判断题 ）",
		"title": "必须从实际出发进行社会主义建设，建设规模和速度要和国力相适应，不能急于求成。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "必须把马克思主义与中国实际相结合，探索符合中国特点的社会主义建设道路。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "必须正确认识社会主义社会的主要矛盾和主要任务，集中力量发展生产力。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "必须发展社会主义民主，加强社会主义法制。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "必须坚持党的民主集中制和集体领导制度，加强执政党建设。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "必须坚持对外开放，借鉴和吸收人类文明的共同成果建设社会主义，不能关起门来搞建设。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "邓小平第一次提出“建设有中国特色的社会主义”的命题是在（ ）。",
		"ans": [
			"☑ 中共十二大"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "把邓小平理论确定为党的指导思想并写入党章是在（ ）。",
		"ans": [
			"☑ 十五大"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "邓小平理论是在( )的基础上逐步形成和发展起来的。",
		"ans": [
			"☑ 总结我国社会主义胜利和挫折的历史经验",
			"☑ 我国改革开放和现代化建设的伟大实践",
			"☑ 和平与发展成为时代主题的历史条件下",
			"☑ 借鉴其他社会主义国家兴衰成败经验教训"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "党的十一届三中全会，停止使用“以阶级斗争为纲”的错误提法，确定把全党的工作重心转移到经济建设上来、实行改革开放的重大决策。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "新中国成立以来，我们在社会主义建设中所经历的曲折和失误，归根到底就在于没有弄清楚我国社会主义初级阶段的主要矛盾、而这正是邓小平理论首要的基本的问题。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "邓小平指出：“贫穷不是社会主义，社会主义要消灭贫穷。”这个论断 ( )",
		"ans": [
			"☑ 体现了社会主义的本质要求"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "第一次系统阐述社会主义初级阶段的理论是在（ ）。",
		"ans": [
			"☑ 党的十三大"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "社会主义初级阶段是不可逾越的，这主要取决于（ ）。",
		"ans": [
			"☑ 生产力发展的不可逾越性"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "现阶段中国最大的实际是（ ）。",
		"ans": [
			"☑ 我国处于社会主义初级阶段"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "坚持党的基本路线不动摇的关键是（ ）。",
		"ans": [
			"☑ 坚持以经济建设为中心不动摇"
		]
	},
	{
		"head": "习题6（单选题 ）",
		"title": "在党的基本路线中，“一个中心，两个基本点”是最主要的内容，是实现社会主义现代化奋斗目标的（ ）",
		"ans": [
			"☑ 基本途径"
		]
	},
	{
		"head": "习题7（单选题 ）",
		"title": "改革开放后，下面不属于我国首批设置经济特区的城市是（ ）。",
		"ans": [
			"☑ 上海浦东"
		]
	},
	{
		"head": "习题8（单选题 ）",
		"title": "把邓小平“三步走”的发展战略构想确定下来是在（ ）",
		"ans": [
			"☑ 党的十三大"
		]
	},
	{
		"head": "习题9（单选题 ）",
		"title": "邓小平指出：“改革是中国的第二次革命”。新时期中国最鲜明的特点是（ ）。",
		"ans": [
			"☑ 改革开放"
		]
	},
	{
		"head": "习题10（单选题 ）",
		"title": "我国实行对外开放的立足点是（ ）。",
		"ans": [
			"☑ 独立自主、自力更生"
		]
	},
	{
		"head": "习题11（单选题 ）",
		"title": "改革的性质是（ ）。",
		"ans": [
			"☑ 社会主义制度的自我完善和发展"
		]
	},
	{
		"head": "习题12（单选题 ）",
		"title": "我国经济体制改革的目标是（ ）。",
		"ans": [
			"☑ 建立社会主义市场经济体制"
		]
	},
	{
		"head": "习题13（多选题 ）",
		"title": "以下没有坚持党的实事求是的思想路线的有（ ）。",
		"ans": [
			"☑ 文化大革命",
			"☑ “大跃进”",
			"☑ 人民公社化运动",
			"☑ “两个凡是”"
		]
	},
	{
		"head": "习题14（多选题 ）",
		"title": "社会主义的本质是（ ）。",
		"ans": [
			"☑ 最终达到共同富裕",
			"☑ 消灭剥削，消除两极分化",
			"☑ 解放生产力，发展生产力"
		]
	},
	{
		"head": "习题15（多选题 ）",
		"title": "社会主义初级阶段包括的两层含义是（ ）。",
		"ans": [
			"☑ 我国社会主义社会还处在初级阶段，我们必须从这个实际出发，而不能超越这个阶段",
			"☑ 我国是社会主义社会，我们必须坚持而不能离开社会主义"
		]
	},
	{
		"head": "习题16（多选题 ）",
		"title": "党在社会主义初级阶段的基本路线指出( )。",
		"ans": [
			"☑ 实现目标的基本途径是：“一个中心，两个基本点”",
			"☑ 实现目标的根本立足点是，“自力更生，艰苦创业”",
			"☑ 初级阶段的奋斗目标是：建设“富强民主文明和谐美丽的社会主义现代化强国”",
			"☑ 实现目标的领导力量和依靠力量是：“领导和团结全国各族人民”"
		]
	},
	{
		"head": "习题17（多选题 ）",
		"title": "邓小平“三步走”发展战略的重要内容是（ ）。",
		"ans": [
			"☑ 从1991年到20世纪末，使国民生产总值再翻一番，达到小康水平；",
			"☑ 从1981年到1990年实现国民生产总值比1980年翻一番，解决人民的温饱问题；",
			"☑ 到21世纪中叶，国民生产总值再翻两番，达到中等发达国家水平，基本实现现代化。"
		]
	},
	{
		"head": "习题18（多选题 ）",
		"title": "改革是一项崭新的事业，如何评价判断改革的成败与是非得失一再成为各种争论的焦点。邓小平在1992年的南方谈话中提出了“三个有利于”的判断标准。内容有( )。",
		"ans": [
			"☑ 是否有利于增强社会主义国家的综合国力",
			"☑ 是否有利于提高人民的生活水平",
			"☑ 是否有利于发展社会主义社会生产力"
		]
	},
	{
		"head": "习题19（多选题 ）",
		"title": "下面属于社会主义市场经济理论的要点有：（ ）",
		"ans": [
			"☑ 市场经济作为资源配置的一种方式本身不具有制度属性，可以和不同的社会制度结合，从而表现出不同的性质。",
			"☑ 计划经济和市场经济不是划分社会制度的标志；"
		]
	},
	{
		"head": "习题20（判断题 ）",
		"title": "邓小平围绕“建设一个什么样的党、怎样建设党”这个基本的理论问题，第一次比较系统的回答了建设中国特色社会主义的一系列基本问题。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题21（判断题 ）",
		"title": "社会主义初级阶段就是指每个进入社会主义社会的国家都必须经历的起始阶段。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题22（判断题 ）",
		"title": "社会主义初级阶段具有长期性是由中国进入社会主义的历史条件和建成社会主义所需要的物质基础所决定的。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题23（判断题 ）",
		"title": "1992年初邓小平《在武昌、深圳、珠海、上海等地的谈话要点》，是全面改革进程中思想解放的科学总结。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题24（判断题 ）",
		"title": "“发展才是硬道理”，中国解决所有问题的关键是要靠自己的发展。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题25（判断题 ）",
		"title": "20世纪70年代末，中国改革首先在农村拉开序幕，废除人民公社制度，建立以家庭联产承包为主，统分结合、双层经营的新型集体所有制。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题26（判断题 ）",
		"title": "我国对外开放的对象发达国家。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题27（判断题 ）",
		"title": "我国改革就是要改变我国的社会主义基本制度。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题28（判断题 ）",
		"title": "离开改革开放谈四项基本原则，四项基本原则就会变成僵化的教条。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题29（判断题 ）",
		"title": "台湾问题的实质是外交问题。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题30（判断题 ）",
		"title": "在台湾问题上，我们的立场是坚持一个中国的原则，争取和平统一，不能使用武力。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "邓小平留给我们的最重要的思想遗产是（ ）",
		"ans": [
			"☑ 邓小平理论"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "下面关于邓小平理论的历史地位，论述正确的有（ ）。",
		"ans": [
			"☑ 是对马克思列宁主义、毛泽东思想的继承和发展",
			"☑ 是改革开放和社会主义现代化的科学指南",
			"☑ 是中国特色社会主义理论的开篇之作"
		]
	},
	{
		"head": "习题3（判断题 ）",
		"title": "邓小平理论是邓小平同志独创的理论成果，是社会主义现代化建设的科学指南。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "邓小平理论是党和国家必须长期坚持的指导思想。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "邓小平理论建构了中国特色社会主义理论的基本框架。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "江泽民在党的（ ）上高度概括了新时期党的建设新的伟大工程的总目标",
		"ans": [
			"☑ 十五大"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "江泽民全面阐述“三个代表”要求的科学内涵和基本内容是在（ ）",
		"ans": [
			"☑ 庆祝中国共产党成立80周年大会上的讲话"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "将“三个代表”重要思想与马克思列宁主义、毛泽东思想和邓小平理论一道确立为党必须长期坚持的指导思想，并写入党章是在（ ）",
		"ans": [
			"☑ 十六大"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "“三个代表”重要思想的形成条件( )",
		"ans": [
			"☑ 是在科学判断党的历史方位和总结历史经验的基础上提出来的",
			"☑ 是在对冷战结束后国际局势科学判断的基础上形成的",
			"☑ 是在建设中国特色社会主义伟大实践基础上形成的"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "2002年5月31日，江泽民在中共中央党校省部级干部进修班毕业典礼上深刻阐述了“三个代表”重要思想的内在联系，提出“贯彻‘三个代表’要求（ ）",
		"ans": [
			"☑ 核心在保持党的先进性",
			"☑ 关键在坚持与时俱进",
			"☑ 本质在坚持执政为民"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "社会主义的根本任务是( )",
		"ans": [
			"☑ 发展社会生产力"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "发展社会主义先进文化，就是发展( )，民族的科学的大众的社会主义文化",
		"ans": [
			"☑ 面向现代化、面向世界、面向未来的"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "发展社会主义先进文化，必须加强（ ），这是发展先进文化的重要内容和中心环节",
		"ans": [
			"☑ 社会主义思想道德建设"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "十四大正式把（ ）确立为我国经济体制改革的目标",
		"ans": [
			"☑ 建立社会主义市场经济体制"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "领导干部一定要讲学习、讲政治、讲正气，其中核心是（ ）",
		"ans": [
			"☑ 讲政治"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "“三个代表”重要思想的核心观点（ ），是对“三个代表”重要思想的集中概括",
		"ans": [
			"☑ 代表中国先进文化的前进方向",
			"☑ 代表中国最广大人民的根本利益",
			"☑ 中国共产党必须始终代表中国先进生产力的发展要求"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "建立和完善社会保障体系，是建立社会主义市场经济体制的重要内容，因此要（ ）",
		"ans": [
			"☑ 完善失业保险制度和城市居民最低生活保障制度",
			"☑ 探索建立农村养老、医疗保险和最低生活保障制度",
			"☑ 完善基本医疗保险制度",
			"☑ 完善城镇职工基本养老保险制度"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "“三个代表”重要思想就是“三个代表”的三句话，并不构成一个体系。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题9（判断题 ）",
		"title": "发展社会主义先进文化，必须作好思想政治工作。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题10（判断题 ）",
		"title": "人民是我们国家的主人，是决定我国前途和命运的根本力量，是历史的真正创造者。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题11（判断题 ）",
		"title": "我们党始终坚持人民的利益高于一切。党除了最广大人民的利益，没有自己特殊的利益。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "“三个代表”重要思想坚持把人民的根本利益作为出发点和归宿，提出“最大多数人的利益是最紧要和最具有决定性的因素”，丰富了（ ）",
		"ans": [
			"☑ 马克思主义唯物史观"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "“三个代表”重要思想( )",
		"ans": [
			"☑ 深化了对中国特色社会主义的认识",
			"☑ 进一步回答了什么是社会主义、怎样建设社会主义的问题",
			"☑ 是党和国家必须长期坚持的指导思想",
			"☑ 创造性地回答了建设什么样的党、怎样建设党的问题"
		]
	},
	{
		"head": "习题3（判断题 ）",
		"title": "“三个代表”重要思想是中国特色社会主义理论体系的继续发展。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "始终做到“三个代表”，是我们党的立党之本、执政之基、力量之源。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "科学发展观提出的根本依据是( )。",
		"ans": [
			"☑ 我国社会主义初级阶段基本国情"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "2004年2月23日，中共中央政治局召开会议指出，要紧紧抓住发展这个第一要务，坚持全面、协调、可持续的科学发展观，着力解决（ ）。",
		"ans": [
			"☑ 经济社会发展中的突出矛盾",
			"☑ 关系人民群众切身利益的突出问题"
		]
	},
	{
		"head": "习题3（判断题 ）",
		"title": "科学发展观是在深入总结改革开放以来特别是党的十九大以来实践经验的基础上形成和发展的。（ ）",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "科学发展观的第一要义是( )。",
		"ans": [
			"☑ 发展"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "科学发展观的核心是( )。",
		"ans": [
			"☑ 以人为本"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "（ ）是科学发展观的根本方法。",
		"ans": [
			"☑ 统筹兼顾"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "（　 　）是科学发展的永恒动力。",
		"ans": [
			"☑ 创新"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "科学发展观强调，社会主义民主政治的本质和核心是（ 　　）。",
		"ans": [
			"☑ 人民当家作主"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "2004年3月，胡锦涛在讲话中明确界定了科学发展观的科学内涵是（　　 ），标志着科学发展观的形成。",
		"ans": [
			"☑ 协调发展",
			"☑ 以人为本",
			"☑ 全面发展",
			"☑ 可持续发展"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "科学发展观所提倡的以人为本，主张（ ）。",
		"ans": [
			"☑ 人是发展的根本动力",
			"☑ 发展的成果惠及全体人民",
			"☑ 人是发展的根本目的"
		]
	},
	{
		"head": "习题8（多选题 ）",
		"title": "科学发展观强调，实现（ ），是我国社会主义现代化建设的战略任务。",
		"ans": [
			"☑ 农业现代化",
			"☑ 信息化",
			"☑ 工业化",
			"☑ 城镇化"
		]
	},
	{
		"head": "习题9（多选题 ）",
		"title": "（ ）是构建社会主义和谐社会的总要求。",
		"ans": [
			"☑ 民主法治",
			"☑ 安定有序、人与自然和谐相处",
			"☑ 公平正义",
			"☑ 诚信友爱、充满活力"
		]
	},
	{
		"head": "习题10（判断题 ）",
		"title": "以人为本就是以最广大人民的根本利益为本。（ ）",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题11（判断题 ）",
		"title": "全面协调可持续是科学发展观的基本要求。（ ）",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题12（判断题 ）",
		"title": "坚持可持续发展，必须走生产发展、生活富裕、生态良好的文明发展道路。（ ）",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题13（判断题 ）",
		"title": "坚持统筹兼顾，必须正确认识和妥善处理中国特色社会主义事业中的重大关系。（ ）",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "( )是当代中国共产党全部理论和全部实践的中心内容。",
		"ans": [
			"☑ 建设中国特色社会主义"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "又好又快发展是（ ）的本质要求，是在经济工作中贯彻落实科学发展观的具体体现。",
		"ans": [
			"☑ 科学发展观"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "落实科学发展观，要坚持把(　 　) 为中心同四项基本原则、改革开放这两个基本点统一于发展中国特色社会主义伟大实践，任何时候都决不能动摇。",
		"ans": [
			"☑ 以经济建设"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "要以改革的精神研究和解决党的建设面临的重大理论和现实问题，进一步解决好党的建设的历史性课题是提高（ ）。",
		"ans": [
			"☑ 党的领导水平和执政水平",
			"☑ 拒腐防变和抵御风险的能力"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "党的十八大以来，以习近平同志为核心的党中央推动党和国家事业取得了全方位的、开创性的历史性成就，主要表现在（ ）个方面",
		"ans": [
			"☑ 十"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "党的十八大以来取得的历史性成就，带来了中国社会（ ）的变革",
		"ans": [
			"☑ 全方位"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "经过长期努力，中国特色社会主义进入了（ ），这是我国发展新的历史方位",
		"ans": [
			"☑ 新时代"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "党的十九大明确指出，我国社会主要矛盾已经转化为（ ）",
		"ans": [
			"☑ 人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "中国特色社会主义进入新时代，在中华人民共和国发展史上、中华民族发展史上具有重大意义（ ）",
		"ans": [
			"☑ 意味着近代以来中华民族迎来了从站起来、富起来到强起来的伟大飞跃",
			"☑ 意味着中国特色社会主义道路、理论、制度、文化不断发展，为解决人类问题贡献了中国智慧和中国方案",
			"☑ 意味着科学社会主义在21世纪的中国焕发出强大生机活力，在世界上高高举起了中国特色社会主义伟大旗帜"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "我国社会主要矛盾已经转化的主要依据有（ ）",
		"ans": [
			"☑ 影响满足人们美好生活需要的因素很多，但主要是发展的不平衡不充分问题",
			"☑ 人民生活水平显著提高，对美好生活的向往更加强烈",
			"☑ 我国社会生产力水平总体上显著提高，很多方面进入世界前列"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "新时代是( )",
		"ans": [
			"☑ 是全国各族人民团结奋斗、不断创造美好生活、逐步实现全体人民共同富裕的时代",
			"☑ 是全体中华儿女奋力实现中华民族伟大复兴中国梦以及我国日益走近世界舞台中央、不断为人类作出更大贡献的时代",
			"☑ 承前启后、继往开来，在新的历史条件下继续夺取中国特色社会主义伟大胜利的时代",
			"☑ 决胜全面建成小康社会、进而全面建设社会主义现代化强国的时代"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "进入新时代，发展不平衡主要指各区域各领域各方面发展不平衡，制约了全国发展水平提升。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "习近平新时代中国特色社会主义思想回答了新时代怎样坚持和发展中国特色社会主义，党的十九大概括为“十四个坚持”，是新时代中国特色社会主义的（ ）",
		"ans": [
			"☑ 基本方略"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "坚持党对一切工作的领导，必须增强四个意识，即（ ）",
		"ans": [
			"☑ 政治意识、大局意识、核心意识、看齐意识"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "党的十九大报告深刻阐述了新时代中国共产党的历史使命，首次提出“四个伟大”，即（ ）",
		"ans": [
			"☑ 伟大事业、伟大梦想",
			"☑ 伟大斗争、伟大工程"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "新时代中国特色社会主义基本方略，是（ ）",
		"ans": [
			"☑ 回答新时代怎样坚持和发展中国特色社会主义的问题",
			"☑ 习近平新时代中国特色社会主义思想的重要组成部分",
			"☑ 落实习近平新时代中国特色社会主义思想的实践要求",
			"☑ 行动纲领层面的表述"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "下列属于习近平新时代中国特色社会主义思想主要内容的有（ ）",
		"ans": [
			"☑ 明确中国特色社会主义事业总体布局是“五位一体”、战略布局是“四个全面”",
			"☑ 明确党在新时代的强军目标是建设一支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队",
			"☑ 明确中国特色大国外交要推动构建新型国际关系，推动构建人类命运共同体",
			"☑ 明确全面推进依法治国总目标是建设中国特色社会主义法治体系、建设社会主义法治国家"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "中国特色社会主义最本质的特征是中国共产党领导，中国特色社会主义制度的最大优势是中国共产党领导。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "第（ ）全国人民代表大会第一次会议把习近平新时代中国特色社会主义思想载入宪法",
		"ans": [
			"☑ 十三届"
		]
	},
	{
		"head": "习题2（多选题 ）",
		"title": "习近平新时代中国特色社会主义思想的历史地位表现在（）",
		"ans": [
			"☑ 马克思主义中国化最新成果",
			"☑ 实现中华民族伟大复兴的行动指南",
			"☑ 新时代的精神旗帜"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "习近平新时代中国特色社会主义思想是马克思主义中国化最新成果，主要表现在（）",
		"ans": [
			"☑ 对人类文明进步做出了新贡献",
			"☑ 开辟了中国特色社会主义新境界",
			"☑ 开辟了马克思主义新境界"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "习近平新时代中国特色社会主义思想是（）",
		"ans": [
			"☑ 是全党全国人民为实现中华民族伟大复兴而奋斗的行动指南",
			"☑ 是中国特色社会主义理论体系的重要组成部分",
			"☑ 是当代中国马克思主义、21世纪马克思主义",
			"☑ 是党和国家必须长期坚持并不断发展的指导思想"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "习近平新时代中国特色社会主义思想是新时代的精神旗帜。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "党的十八大通过的党章修正案，把习近平新时代中国特色社会主义思想确立为党的指导思想。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "习近平新时代中国特色社会主义思想为新时代治国理政提供了基本遵循。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "国家富强、民族振兴的根本出发点和落脚点是（ ）。",
		"ans": [
			"☑ 人民幸福"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "民族精神就是以（ ）为核心的精神。",
		"ans": [
			"☑ 爱国主义"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "实现中华民族伟大复兴是海内外中华儿女的共同梦想，这里的中华儿女除了内地人民外，还包括（ ）。",
		"ans": [
			"☑ 港澳台同胞和海外侨胞"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "习近平总书记在参观《复兴之路》展览时，曾引用哪三句诗概括了近代以来中国人民寻梦、追梦、圆梦的历史进程。（ ）",
		"ans": [
			"☑ 雄关漫道真如铁",
			"☑ 长风破浪会有时",
			"☑ 人间正道是沧桑"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "中国梦的本质是（ ）。",
		"ans": [
			"☑ 民族振兴",
			"☑ 人民幸福",
			"☑ 国家富强"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "要实现中国梦，要求我们必须（ ）。",
		"ans": [
			"☑ 走中国道路",
			"☑ 弘扬中国精神",
			"☑ 凝聚中国力量"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "2012年以来，习近平多次向世界宣示：中国梦是（ ）的梦。",
		"ans": [
			"☑ 共赢",
			"☑ 和平",
			"☑ 合作",
			"☑ 发展"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "综合分析国际国内形势和我国发展条件，习近平在十九大报告中提出，从2020年到本世纪中叶可以分两个阶段来安排。第二个阶段，从＿＿到＿＿，在基本实现现代化的基础上，再奋斗十五年，把我国建成富强民主文明和谐美丽的社会主义现代化强国。（ ）",
		"ans": [
			"☑ 2035年　 本世纪中叶"
		]
	},
	{
		"head": "习题2（判断题 ）",
		"title": "在新时代，我国基本实现现代化的时间是在2021年。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题3（判断题 ）",
		"title": "党的十七大、十八大提出了“两个一百年”的奋斗目标，第一个一百年奋斗目标就是到建党100周年时年建成更高水平的小康社会。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "（ ）是一国经济的立身之本，是财富创造的根本源泉，是国家强盛的重要支柱，是现代化经济体系的坚实基础。",
		"ans": [
			"☑ 实体经济"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "伴随中国特色社会主义进入新时代，我国经济已由高速增长阶段转向（ ）阶段。",
		"ans": [
			"☑ 高质量发展"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "（ ）是党中央从党和国家事业全局出发，着眼于实现“两个一百年”奋斗目标、顺应中国特色社会主义进入新时代的新要求作出的重大决策部署。",
		"ans": [
			"☑ 建设现代化经济体系"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "深入实施科教兴国战略、人才强国战略等发展战略，努力实现到2035年跻身（ ）国家前列的目标。",
		"ans": [
			"☑ 创新型"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "坚持协调发展理念，优化区域发展格局，实现（ ），人民生活水平大体相当。",
		"ans": [
			"☑ 基本公共服务均等化"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "党的十八届五中全会坚持以人民为中心的发展思想，鲜明提出了（ ）的新发展理念。",
		"ans": [
			"☑ 共享",
			"☑ 协调",
			"☑ 绿色",
			"☑ 开放",
			"☑ 创新"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "（ ）是推动供给侧结构性改革、振兴实体经济发展的重要力量。",
		"ans": [
			"☑ 劳模",
			"☑ 工匠",
			"☑ 高素质的企业家"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "协调发展就是搞平均主义。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题9（判断题 ）",
		"title": "创新是引领发展的第一动力。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "（ ）是我国根本政治制度。",
		"ans": [
			"☑ 人民代表大会制度"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "（ ）是两岸关系的政治基础。",
		"ans": [
			"☑ 一个中国原则"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "（ ）是永恒的主题，是香港、澳门的立身之本，也是保持香港、澳门国际地位和解决香港、澳门各种问题的金钥匙。",
		"ans": [
			"☑ 发展"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "走中国特色社会主义政治发展道路，必须坚持（ ）有机统一。",
		"ans": [
			"☑ 人民当家作主",
			"☑ 依法治国",
			"☑ 党的领导"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "牢牢把握（ ）的主题，做好统战工作。",
		"ans": [
			"☑ 大团结",
			"☑ 大联合"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "照抄照搬他国的政治制度行不通。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "无论本土宗教还是外来宗教，都要不断适应我国社会发展，充实时代内涵。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "掌握意识形态工作领导权，要旗帜鲜明坚持（ ）。",
		"ans": [
			"☑ 马克思主义指导地位"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "（ ）是一个民族赖以维系的精神纽带，是一个国家共同的思想道德基础。",
		"ans": [
			"☑ 核心价值观"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "文化建设应该把（ ）放在首位。",
		"ans": [
			"☑ 社会效益"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "社会主义核心价值体系由（ ）方面内容构成。",
		"ans": [
			"☑ 以改革创新为核心的时代精神",
			"☑ 马克思主义指导思想",
			"☑ 以爱国主义为核心的民族精神",
			"☑ 社会主义荣辱观",
			"☑ 中国特色社会主义共同理想"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "文化强国是指一个国家具有强大的文化力量。这种力量表现为（ ）。",
		"ans": [
			"☑ 具有高度文化素养的国民",
			"☑ 强大的文化软实力",
			"☑ 发达的文化产业"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "习近平在十三届全国人大一次会议上概括的四种精神是（ ）。",
		"ans": [
			"☑ 伟大的梦想精神",
			"☑ 伟大的奋斗精神",
			"☑ 伟大的创造精神",
			"☑ 伟大的团结精神"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "网络空间是亿万民众共同的精神家园，但它和现实社会不一样，只需要提倡自由，可以不保持秩序。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "旗帜鲜明反对和抵制各种错误观点不用区分政治原则问题、思想认识问题、学术观点问题。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "（ ）是中华民族伟大复兴的基础工程。",
		"ans": [
			"☑ 建设教育强国"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "（ ）是最大的民生。",
		"ans": [
			"☑ 就业"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "（ ）是党和政府联系、服务居民群众的“最后一公里”。",
		"ans": [
			"☑ 社区"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "（ ）是老百姓解决温饱后的第一需求，是极重要的民生，也是最基本的发展环境。",
		"ans": [
			"☑ 平安"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "坚持完善（ ）的社会治理体制。",
		"ans": [
			"☑ 党委领导",
			"☑ 政府负责",
			"☑ 社会协同",
			"☑ 公众参与"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "加强和改进思想政治工作，更加注重（ ），着力促进公民道德素质的提升。",
		"ans": [
			"☑ 人文关怀",
			"☑ 心理疏导"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "消除贫困、改善民生、逐步实现共同富裕，是社会主义的本质要求，是我们党的重要使命。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "新时代我国面临的安全和发展环境并不复杂，各种可以预见和难以预见的风险因素明显减少。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题9（判断题 ）",
		"title": "党和政府应加强和创新对建设社会主义和谐社会各项工作的领导，把发展经济、提高国家文化软实力作为社会建设的根本任务。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "生态文明的核心是坚持（ ）。",
		"ans": [
			"☑ 人与自然和谐共生"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "我们要坚持（ ）的基本国策，为人民创造良好生产生活环境，努力形成人与自然和谐发展新格局。",
		"ans": [
			"☑ 节约资源和保护环境"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "保护自然生态系统，维护人与自然之间形成的生命共同体，必须树立（ ）的生态文明理念。",
		"ans": [
			"☑ 尊重自然",
			"☑ 顺应自然",
			"☑ 保护自然"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "虽然说生态兴则文明兴，生态衰则文明衰，但随着人类文明的发展，生态环境可以找到替代品。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "在生态系统保护和修复中，把利用自然力修复生态系统放在首位。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "“四个全面”的本质是（ ）",
		"ans": [
			"☑ 战略布局"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "跨过实现现代化建设第三步战略目标必经的承上启下的重要发展阶段的标志是（ ）",
		"ans": [
			"☑ 全面建成小康社会"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "党的十八大提出了到（ ）年全面建成小康社会的奋斗目标。",
		"ans": [
			"☑ 2020"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "下面关于“四个全面”战略布局说法正确的是（ ）",
		"ans": [
			"☑ 全面深化改革是根本动力",
			"☑ 全面依法治国是法治保障",
			"☑ 全面建成小康社会是奋斗目标",
			"☑ 全面从严治党是政治保证"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "坚决打好精准扶贫攻坚战要坚持（ ）“三位一体”的大扶贫格局。",
		"ans": [
			"☑ 社会扶贫",
			"☑ 行业扶贫",
			"☑ 专项扶贫"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "全面小康，覆盖的人口要全面，是惠及全体人民的小康。全面小康，覆盖的区域要全面，是城乡共同发展的小康。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "全面小康，覆盖的领域要全面，是“三位一体”全面进步的小康。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "“四个全面”战略布局中具有突破性和先导性的关键环节是（ ）",
		"ans": [
			"☑ 全面深化改革"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "全面深化改革的实现路径是（ ）",
		"ans": [
			"☑ 推进国家治理体系和治理能力现代化"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "注重（ ）是全面深化改革的内在要求，也是推进改革的重要方法。",
		"ans": [
			"☑ 协同性",
			"☑ 系统性",
			"☑ 整体性"
		]
	},
	{
		"head": "习题4（判断题 ）",
		"title": "国家治理体系和治理能力是一个国家的制度和制度执行能力的集中体现。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "（ ）明确提出全面依法治国。",
		"ans": [
			"☑ 十八届四中全会"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "（ ）是社会主义法治最根本的保证。",
		"ans": [
			"☑ 坚持党的领导"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "（ ）是中国特色社会主义的本质要求和重要保障。",
		"ans": [
			"☑ 全面依法治国"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "中国特色社会主义法律体系的核心是（ ）。",
		"ans": [
			"☑ 宪法"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "严格依法办事是法治区别于人治的重要标志。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "党的十一届三中全会明确提出了“发展社会主义民主、健全社会主义法治”的重大方针。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "法律具有规范社会行为、调节社会关系、维护社会秩序的作用。道德不具有这些方面的作用。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "党的十九大首次把（ ）纳入党的建设总体布局。",
		"ans": [
			"☑ 党的政治建设"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "全面从严治党的长远之策、根本之策是加强（ ）。",
		"ans": [
			"☑ 制度建设"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "治理国家，制度是起（ ）作用的。",
		"ans": [
			"☑ 协调性"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "十六大提出，发展社会主义民主政治，最根本的是要把（ ）统一起来。",
		"ans": [
			"☑ 坚持党的领导",
			"☑ 依法治国",
			"☑ 人民当家作主"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "党的政治建设的首要任务是（ ）。",
		"ans": [
			"☑ 坚持党中央权威和集中统一领导",
			"☑ 保证全党服从中央"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "“坚持党要管党、全面从严治党”是新时代党的建设的根本方针。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "党的组织建设的核心是保持党同人民群众的血肉联系。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "人民军队完全区别于一切旧军队的政治特质和根本优势是（ ）。",
		"ans": [
			"☑ 党对军队的绝对领导"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "党的强军目标提出，到本世纪中叶，要把我们国家的人民军队建成（ ）。",
		"ans": [
			"☑ 世界一流军队"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "党对军队的绝对领导定型于（ ）。",
		"ans": [
			"☑ 古田会议"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "党的十八大以来，形成了习近平强军思想，习近平强军思想主要深刻回答了新时代（ ）的时代课题。",
		"ans": [
			"☑ 怎样建设强大人民军队",
			"☑ 建设一支什么样的强大人民军队"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "依法治军是人民军队建军之本、强军之魂。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "实现把人民军队全面建成世界一流军队目标的时间是在2035年。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "科技是现代战争的核心战斗力。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "党委统一的集体领导下的首长分工负责制是党领导军队的根本制度。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "建设世界一流军队的力量基础是（ ）。",
		"ans": [
			"☑ 构建中国特色现代军事力量体系"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "军民融合，源于我们党的（ ）的思想。",
		"ans": [
			"☑ 军民结合、寓军于民"
		]
	},
	{
		"head": "习题3（多选题 ）",
		"title": "加快形成我国军民融合深度发展的格局，要求（ ）。",
		"ans": [
			"☑ 突出重点领域",
			"☑ 坚持全国一盘棋",
			"☑ 强化战略规划",
			"☑ 健全体制机制"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "党对军队的绝对领导，是包括（ ）在内的全面领导。",
		"ans": [
			"☑ 组织领导",
			"☑ 思想领导",
			"☑ 政治领导"
		]
	},
	{
		"head": "习题5（判断题 ）",
		"title": "军民融合是实现富国和强军相统一的重要途径",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "军民融合意味着对社会组织也要按照军事化进行管理",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "进入21世纪以来，世界正处于（ ）时期。",
		"ans": [
			"☑ 大发展、大变革、大调整"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "当今时代主题仍然是（ ）。",
		"ans": [
			"☑ 和平与发展"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "1953年12月，（ ）在会见印度政府代表团时，首次系统地提出了和平共处五项原则。",
		"ans": [
			"☑ 周恩来"
		]
	},
	{
		"head": "习题4（单选题 ）",
		"title": "新型国际关系，特别是“新”在（ ）。",
		"ans": [
			"☑ 合作共赢"
		]
	},
	{
		"head": "习题5（单选题 ）",
		"title": "中国外交政策的宗旨是（ ）。",
		"ans": [
			"☑ 维护世界和平、促进共同发展"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "成为当今不可阻挡的时代潮流是（ ）。",
		"ans": [
			"☑ 合作",
			"☑ 发展",
			"☑ 共赢",
			"☑ 和平"
		]
	},
	{
		"head": "习题7（多选题 ）",
		"title": "当今世界呈现出（ ）。",
		"ans": [
			"☑ 社会信息化快速发展、科学技术孕育新突破",
			"☑ 经济全球化深入发展",
			"☑ 世界多极化在曲折中发展",
			"☑ 文化多样化持续推进"
		]
	},
	{
		"head": "习题8（多选题 ）",
		"title": "中国走和平发展道路的自信和自觉，来源于（ ）。",
		"ans": [
			"☑ 中华文明的深厚渊源",
			"☑ 对实现中国发展目标条件的认知",
			"☑ 对世界发展大势的把握"
		]
	},
	{
		"head": "习题9（多选题 ）",
		"title": "建立新型国际关系,按照（ ）的外交工作布局。",
		"ans": [
			"☑ 发展中国家是基础",
			"☑ 大国是关键",
			"☑ 多边是舞台",
			"☑ 周边是首要"
		]
	},
	{
		"head": "习题10（判断题 ）",
		"title": "和平共处五项原则一直是我国处理对外关系的基本准则。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题11（判断题 ）",
		"title": "实现中华民族伟大复兴的中国梦的奋斗目标，必须要有和平国际环境。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题12（判断题 ）",
		"title": "中国坚定不移地奉行独立自主的和平外交政策，是由我国的社会主义性质和在国际上的地位所决定的。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题13（判断题 ）",
		"title": "推动建立新型国际关系，要坚决维护国家核心利益。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "习近平深刻思考人类前途命运及中国和世界发展大势所提出的宏伟构想和中国方案是（ ）。",
		"ans": [
			"☑ 推进“一带一路”建设"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "人类命运共同体提出的背景不包括：（ ）",
		"ans": [
			"☑ 中国大国地位的确立"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "下列“一带一路”倡议的表述正确的是：（ ）",
		"ans": [
			"☑ “一带一路”倡议对于构建人类命运共同体具有重要意义"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "中国政府倡议，共建“一带一路”秉持（ ）的理念。",
		"ans": [
			"☑ 互学互鉴",
			"☑ 互利共赢",
			"☑ 和平合作",
			"☑ 开放包容"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "人类命运共同体的内涵包括：（ ）",
		"ans": [
			"☑ 经济上开放、包容、普惠、平衡、共赢",
			"☑ 生态上，坚持环境友好，共同应对生态变化",
			"☑ 政治上相互尊重、平等协商",
			"☑ 文化上，坚持民族文化优越性",
			"☑ 安全上，以对话协商化解分歧"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "构建人类命运共同体的途径包括：（ ）",
		"ans": [
			"☑ 推动国际关系向伙伴关系、安全格局等方向努力",
			"☑ 坚持和平发展道路，推动建设新型国际关系",
			"☑ 深度参与全球治理，积极引导国际秩序变革方向",
			"☑ 不断完善外交格局，积极发展全球伙伴关系"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "“一带一路”与构建人类命运共同体没有关系。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "构建人类命运共同体既是中国外交的崇高目标，也是世界各国的共同责任和历史使命。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题9（判断题 ）",
		"title": "“一带一路”实际上是中国主导的国际贸易体系",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题10（判断题 ）",
		"title": "“一带一路”只涉及贸易问题",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "中国特色社会主义制度的最大优势是（ ）。",
		"ans": [
			"☑ 中国共产党的领导"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "近代以来中华民族最伟大的梦想是（ ）。",
		"ans": [
			"☑ 实现中华民族伟大复兴"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "中国特色社会主义制度优势的主要来源是（ ）。",
		"ans": [
			"☑ 中国共产党的自身优势"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "中国共产党是（ ）。",
		"ans": [
			"☑ 中国人民和中华民族的先锋队",
			"☑ 中国特色社会主义事业的领导核心",
			"☑ 中国工人阶级的先锋队"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "实现伟大梦想，必须（ ）。",
		"ans": [
			"☑ 推进中国特色社会主义伟大事业",
			"☑ 进行具有许多新的历史特点的伟大斗争",
			"☑ 深入推进党的建设新的伟大工程"
		]
	},
	{
		"head": "习题6（判断题 ）",
		"title": "中国共产党的领导地位是历史和人民的选择。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "历史表明，中国共产党领导中国人民开辟的中国特色社会主义道路是正确的，必须长期坚持、永不动摇。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题8（判断题 ）",
		"title": "历史表明，中国共产党和中国人民扎根中国大地、吸纳人类文明优秀成果、独立自主实现国家发展的战略是正确的，必须长期坚持、永不动摇。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题9（判断题 ）",
		"title": "实现中华民族伟大复兴关键在全面依法治国。",
		"ans": [
			"☑ 错误"
		]
	},
	{
		"head": "习题10（判断题 ）",
		"title": "中国特色社会主义是改革开放以来党的全部理论和实践的主题，是党和人民历尽千辛万苦、付出巨大代价取得的根本成就。",
		"ans": [
			"☑ 正确"
		]
	},
	{
		"head": "习题1（单选题 ）",
		"title": "中国共产党作为最高政治力量在治国理政中的重要体现是（ ）。",
		"ans": [
			"☑ 坚持党总揽全局、协调各方的领导核心地位"
		]
	},
	{
		"head": "习题2（单选题 ）",
		"title": "新的历史条件下中国共产党执政的基本方式是（ ）。",
		"ans": [
			"☑ 依法执政"
		]
	},
	{
		"head": "习题3（单选题 ）",
		"title": "党的十九大确定的宏伟蓝图要变为现实，关键是要（ ）。",
		"ans": [
			"☑ 狠抓落实"
		]
	},
	{
		"head": "习题4（多选题 ）",
		"title": "确保党始终总揽全局、协调各方，必须（ ）。",
		"ans": [
			"☑ 自觉维护党中央权威和集中统一领导",
			"☑ 增强政治意识、大局意识、核心意识、看齐意识",
			"☑ 坚持和完善党的领导的体制机制、坚持党的民主集中制原则",
			"☑ 自觉在思想上政治上行动上同党中央保持高度一致"
		]
	},
	{
		"head": "习题5（多选题 ）",
		"title": "这是中国共产党的领导决策核心是（ ）。",
		"ans": [
			"☑ 中央政治局常委会",
			"☑ 中央政治局",
			"☑ 中央委员会"
		]
	},
	{
		"head": "习题6（多选题 ）",
		"title": "全面增强党的执政本领就是增强（ ）。",
		"ans": [
			"☑ 学习本领和政治领导本领",
			"☑ 狠抓落实本领和驾驭风险本领",
			"☑ 依法执政本领和群众工作本领",
			"☑ 改革创新本领和科学发展本领"
		]
	},
	{
		"head": "习题7（判断题 ）",
		"title": "坚持中国共产党的领导，是党和国家的根本所在、命脉所在。",
		"ans": [
			"☑ 正确"
		]
	}
]
// 选取答案
function getans() {
	var ansHead = document.getElementsByName('xt');
	for (let i in ansHead) {
		// 数据对象是否可用
		if (i === '0' || isNaN(parseInt(i))) continue
		// 是否能答题
		let className = ansHead[i].getAttribute('class')
		if (className == 'ed-ans' || className == 'lock-ans') continue
		// 获取答案按钮
		let ansContent = ansHead[i].getElementsByTagName('input'), ans
		let ansId = ansHead[i].getAttribute('id')
		// 寻找题目
		let title = ansHead[i].getElementsByTagName('p')[0].innerText
		let content = ansHead[i].getElementsByTagName('li')
		let titleAns = []
		allAns.map(item => {
			if (item.title == title) {
				titleAns.push(item.ans.toString())
			}
		})
		if (titleAns.length == 0) continue
		switch(ansHead[i].getAttribute('tagtype')) {
			case '1':
				for (let j = 0; j < content.length; j++) {
					if (titleAns[0].indexOf(content[j].innerText) > -1) {
						ans = j
					}
				}
				ansContent[ans].checked = true
				break;
			case '2':
				for (let k = 0; k < 4; k++) {
					titleAns.map(item => {
						if (item.indexOf(content[k].innerText) > - 1) {
							ansContent[k].checked = true
						}
					})
					
				}
				break;
			case '3':
				for (let i = 0; i < content.length; i++) {
					console.log(titleAns)
					if (titleAns[0].indexOf(content[i].innerText) > -1) {
						ans = i
					}
				}
				ansContent[ans].checked = true
				break;
		}
	}
	// 触发点击事件
	if (document.getElementsByClassName('btn100_org')[0]) {

		document.getElementsByClassName('btn100_org')[0].dispatchEvent(new MouseEvent('click', {
		    view: window,
		    bubbles: true,
		    cancelable: true
		  }))
	}
	if (document.getElementsByClassName('aui_state_highlight')[0]) {
			
		document.getElementsByClassName('aui_state_highlight')[0].dispatchEvent(new MouseEvent('click', {
		    view: window,
		    bubbles: true,
		    cancelable: true
		  }))
	}
	
}

// 媒体评价
function media() {
	var mediaBox = document.getElementsByClassName("Mshow")
	for (let i = 0; i < mediaBox.length; i++) {
		if (isNaN(parseInt(i))) continue
		if (mediaBox[i].getElementsByClassName('BT_ping')[0].innerText === '已评价') continue
		let mediaId = mediaBox[i].parentElement.getAttribute('name').replace('media_', '')
		var param = {
			'id': mediaId,
			'type': 3
		}
		submitDot(param ,"doWkMediaPj","doWkMediaPj");
		mediaBox[i].getElementsByClassName('BT_ping')[0].innerText = '已评价'
		mediaBox[i].getElementsByClassName('BT_ping')[0].className = "BT_ping Ped"
	}
	var judged = document.getElementsByClassName('Ped')
	if (judged.length !== mediaBox.length) {
		media()
	} else {
		return true
	}
}

var urls = document.getElementsByClassName("bookNav_list")[0].getElementsByTagName("a"), index = 0

function addNum() {
	for (let i = 0; i < urls.length; i++) {
		if (urls[i].href == window.location.href) {
			index = i
			break
		}
	}
	// 动态插入的需延迟执行
	var completeMedia = false
	setTimeout( () => {
		getans()
		completeMedia = media()
	}, 800)
	
	if (index < urls.length - 1) {
		setTimeout(jump, 2000)
	}
	function jump() {
		if (!completeMedia) jump()
		index += 1
		window.location.href = urls[index].href
	}
}
addNum()